nimsara1999/gas_sensor_ble_esp32/src/main.cpp
        if (inSensorSearchingMode)
        {
          if (type == "21")
          {
            Serial.println("\nFound a SYNCed sensor");
            inSensorSearchingMode = false;
            selected_sensor_mac_address = macAddress.c_str();
            Serial.print("MAC Address: ");
            Serial.println(selected_sensor_mac_address);
          }
        }
        else
        {
          if (strcmp(macAddress.c_str(), selected_sensor_mac_address.c_str()) == 0)
          {
            float measurement = (hex_to_int(measurementHex)) * sound_speed / 2000;

            int battery = hex_to_int(batteryHex);

            // Serial.print("Received Payload: ");
            // Serial.println(hexAdvData.c_str());

            timeClient.update();
            unsigned long epochTime = timeClient.getEpochTime();

            postData = String("{\"DATETIME\":") + String(epochTime) +
                       ",\"IMEI\":\"" + String(advertisedDevice.getAddress().toString().c_str()) + "\"," +
                       "\"NCU_FW_VER\":\"" + String(current_fw_version) + "\"," +
                       "\"GAS_METER\":" + String(measurement / 10) + "," +
                       "\"CSQ\":104," +
                       "\"MCU_TEMP\":30," +
                       "\"BAT_VOL\":" + String(battery) + "," +
                       "\"METER_TYPE\":4," +
                       "\"TIME_ZONE\":\"" + String(timeZone) + "\"," +
                       "\"TANK_SIZE\":\"" + String(tankSize) + "\"," +
                       "\"GAS_PERCENT\":" + String(measurement * 100 / loadedHeight.toFloat()) + "," +
                       "\"LONGITUDE\":\"" + String(longitude) + "\"," +
                       "\"LATITUDE\":\"" + String(latitude) + "\"," +
                       "\"LOADED_HEIGHT\":" + String(loadedHeight.toFloat()) + "," +
                       "\"RSSI\":" + String(advertisedDevice.getRSSI()) + "}";

            if (millis() - lastSendTime > 5000)
            {
              createHTTPSTask();
              lastSendTime = millis();
            }
          }
        }
      }
    }
  }
};

void switchToAPMode()
{
  Serial.println("\n\n****************************************************************************************************\n****************************************************************************************************");
  Serial.println("\nManually switching to AP mode...");
  bluetooth_sending_status = false;
  WiFi.mode(WIFI_AP);
  inAPMode = true;
  WiFi.softAP(ap_ssid, ap_password);
  Serial.println("\nAccess Point Started");
  Serial.print("AP IP Address: ");
  Serial.println(WiFi.softAPIP());
}

void blinkLEDInAPMode()
{
  if (automatically_put_to_AP_mode)
  {
    Serial.println("Trying to connect to the last saved Wi-Fi network...");
    if (tryConnectToSavedWiFi())
    {
      inAPMode = false;
      WiFi.mode(WIFI_STA);
      indicateSuccessfulConnection();
      bluetooth_sending_status = true;
      Serial.println("Connected to the last saved Wi-Fi network... Restarting the gateway");
      delay(500);
      ESP.restart();
    }
    else
    {
      Serial.println("Failed to connect to the last saved Wi-Fi network.\nRetrying in 2 second...");
      delay(2000);
      WiFi.mode(WIFI_AP_STA);
      handleButtonPress();
    }
  }
  else
  {
    unsigned long currentMillis = millis();
    if (currentMillis - previousMillis >= blink_interval)
    {
      previousMillis = currentMillis;
      led_state = !led_state;
      if (led_state)
      {
        strip.setPixelColor(0, strip.Color(0, 0, LED_brightness));
      }
      else
      {
        strip.setPixelColor(0, strip.Color(0, 0, 0));
      }
      strip.show();
    }
  }
}

bool handleButtonPress()
{
  if (digitalRead(BOOT_PIN) == LOW)
  {
    delay(100);
    if (digitalRead(BOOT_PIN) == LOW)
    {
      Serial.println("\nBoot Button press recognized");
      automatically_put_to_AP_mode = false;
      switchToAPMode();
      return true;
    }
    return false;
  }
  return false;
}

void saveWiFiCredentials(const String &ssid, const String &password)
{
  EEPROM.begin(EEPROM_SIZE);

  for (int i = SSID_ADDR; i < SSID_ADDR + 50; i++)
    EEPROM.write(i, 0);
  for (int i = PASS_ADDR; i < PASS_ADDR + 50; i++)
    EEPROM.write(i, 0);

  for (int i = 0; i < ssid.length(); i++)
    EEPROM.write(SSID_ADDR + i, ssid[i]);
  for (int i = 0; i < password.length(); i++)
    EEPROM.write(PASS_ADDR + i, password[i]);
  Serial.println("Saved Wi-Fi credentials to EEPROM");

  EEPROM.commit();

  blinkRGBLedInPattern(1, 0, LED_brightness, LED_brightness, 1000, 10); // cyan LED single long pulse
  blinkRGBLedInPattern(1, 0, LED_brightness, 0, 50, 50, 100, 100);      // green LED two short pulses
}

void saveFwVersion(const String &fw_version)
{
  EEPROM.begin(EEPROM_SIZE);

  for (int i = FW_VERSION_ADDR; i < FW_VERSION_ADDR + 50; i++)
    EEPROM.write(i, 0);

  for (int i = 0; i < fw_version.length(); i++)
    EEPROM.write(FW_VERSION_ADDR + i, fw_version[i]);
  Serial.println("Saved FW Version to EEPROM");

  EEPROM.commit();
}

void saveOtherConfigDataToEEPROM(const String &tankSize, const String &timeZone, const String &longitude, const String &latitude, const String &loadedHeight)
{
  EEPROM.begin(EEPROM_SIZE);

  for (int i = TANKSIZE_ADDR; i < TANKSIZE_ADDR + 50; i++)
    EEPROM.write(i, 0);
  for (int i = TIMEZONE_ADDR; i < TIMEZONE_ADDR + 50; i++)
    EEPROM.write(i, 0);
  for (int i = LONGITUDE_ADDR; i < LONGITUDE_ADDR + 50; i++)
    EEPROM.write(i, 0);
  for (int i = LATITUDE_ADDR; i < LATITUDE_ADDR + 50; i++)
    EEPROM.write(i, 0);
  for (int i = LOADED_HEIGHT_ADDR; i < LOADED_HEIGHT_ADDR + 50; i++)
    EEPROM.write(i, 0);

  for (int i = 0; i < tankSize.length(); i++)
    EEPROM.write(TANKSIZE_ADDR + i, tankSize[i]);
  for (int i = 0; i < timeZone.length(); i++)
    EEPROM.write(TIMEZONE_ADDR + i, timeZone[i]);
  for (int i = 0; i < longitude.length(); i++)
    EEPROM.write(LONGITUDE_ADDR + i, longitude[i]);
  for (int i = 0; i < latitude.length(); i++)
    EEPROM.write(LATITUDE_ADDR + i, latitude[i]);
  for (int i = 0; i < loadedHeight.length(); i++)
    EEPROM.write(LOADED_HEIGHT_ADDR + i, loadedHeight[i]);

  EEPROM.commit();

