nimsara1999/gas_sensor_ble_esp32/src/main.cpp
  Serial.println("Saved other configuration data to EEPROM");
  blinkRGBLedInPattern(1, 0, LED_brightness, LED_brightness, 1000, 10); // cyan LED single long pulse
  blinkRGBLedInPattern(1, 0, LED_brightness, 0, 50, 50, 100, 100);      // green LED two short pulses
}

void loadWiFiCredentials(String &ssid, String &password)
{
  EEPROM.begin(EEPROM_SIZE);

  char ssidBuff[50];
  char passBuff[50];

  for (int i = 0; i < 50; i++)
    ssidBuff[i] = EEPROM.read(SSID_ADDR + i);
  for (int i = 0; i < 50; i++)
    passBuff[i] = EEPROM.read(PASS_ADDR + i);

  ssid = String(ssidBuff);
  password = String(passBuff);
  Serial.println("Loaded Wi-Fi credentials from EEPROM");

  char tankSizeBuff[50];
  char timeZoneBuff[50];
  char longitudeBuff[50];
  char latitudeBuff[50];
  char loadedHeightBuff[50];
  char selectedSensorMacBuff[50];
  char fwVersionBuff[50];

  for (int i = 0; i < 50; i++)
    tankSizeBuff[i] = EEPROM.read(TANKSIZE_ADDR + i);
  for (int i = 0; i < 50; i++)
    timeZoneBuff[i] = EEPROM.read(TIMEZONE_ADDR + i);
  for (int i = 0; i < 50; i++)
    longitudeBuff[i] = EEPROM.read(LONGITUDE_ADDR + i);
  for (int i = 0; i < 50; i++)
    latitudeBuff[i] = EEPROM.read(LATITUDE_ADDR + i);
  for (int i = 0; i < 50; i++)
    loadedHeightBuff[i] = EEPROM.read(LOADED_HEIGHT_ADDR + i);
  for (int i = 0; i < 50; i++)
    selectedSensorMacBuff[i] = EEPROM.read(SENSOR_MAC_ADDR + i);
  for (int i = 0; i < 50; i++)
    fwVersionBuff[i] = EEPROM.read(FW_VERSION_ADDR + i);

  tankSize = String(tankSizeBuff);
  timeZone = String(timeZoneBuff);
  longitude = String(longitudeBuff);
  latitude = String(latitudeBuff);
  loadedHeight = String(loadedHeightBuff);
  selected_sensor_mac_address = String(selectedSensorMacBuff);
  current_fw_version = String(fwVersionBuff);

  Serial.println("Loaded other configuration data from EEPROM");
  blinkRGBLedInPattern(1, 0, LED_brightness, LED_brightness, 500, 10); // cyan LED single long pulse
  blinkRGBLedInPattern(1, 0, LED_brightness, 0, 50, 50, 100, 100);     // blue LED two short pulses
}

bool tryConnectToSavedWiFi()
{
  WiFi.mode(WIFI_AP_STA);
  String savedSSID, savedPassword;
  loadWiFiCredentials(savedSSID, savedPassword);

  if (savedSSID.length() > 0 && savedPassword.length() > 0)
  {
    Serial.print("Trying to connect to saved SSID: ");
    Serial.print(savedSSID);

    WiFi.begin(savedSSID.c_str(), savedPassword.c_str());

    int maxRetries = 8;
    int retries = 0;

    while (WiFi.status() != WL_CONNECTED && retries < maxRetries)
    {
      delay(950);
      blinkRGBLedInPattern(1, LED_brightness, LED_brightness, LED_brightness, 50, 0);
      Serial.print(".");
      retries++;
    }

    if (WiFi.status() == WL_CONNECTED)
    {
      Serial.println("\nSuccessfully connected to saved Wi-Fi");
      indicateSuccessfulConnection();
      Serial.print("IP Address: ");
      Serial.println(WiFi.localIP());
      inAPMode = false;
      return true;
    }
  }
  Serial.println("Failed to connect to saved Wi-Fi");
  indicateUnsuccessfulConnection();
  WiFi.mode(WIFI_AP_STA);
  return false;
}

void handle_check_internet_connection()
{
  Serial.println("\nChecking Internet connection...");
  if (server.method() == HTTP_GET)
  {
    if (WiFi.status() == WL_CONNECTED)
    {
      if (client.connect("www.google.com", 443))
      {
        Serial.println("Connected to the Internet");
        Serial.println("Restart the gateway to start sending data to the server");
        server.send(200, "application/json", "{\"internet_connected\": 1, \"wifi_connected\": 1}");
      }
      else
      {
        Serial.println("No Internet access");
        server.send(200, "application/json", "{\"internet_connected\": 0, \"wifi_connected\": 1}");
      }

      client.stop();
    }
    else
    {
      Serial.println("Not connected to Wi-Fi");
      server.send(200, "application/json", "{\"internet_connected\": 0, \"wifi_connected\": 0}");
    }
  }
}

// blink blue and then green for 2 times
void indicateSuccessfulConnection()
{
  blinkRGBLedInPattern(1, 0, 0, LED_brightness, 500, 0);
  blinkRGBLedInPattern(1, 0, LED_brightness, 0, 500, 500);
  blinkRGBLedInPattern(1, 0, 0, LED_brightness, 500, 0);
  blinkRGBLedInPattern(1, 0, LED_brightness, 0, 500, 0);
}

// blink blue and then red for 2 times
void indicateUnsuccessfulConnection()
{
  blinkRGBLedInPattern(1, 0, 0, LED_brightness, 500, 0);
  blinkRGBLedInPattern(1, LED_brightness, 0, 0, 500, 500);
  blinkRGBLedInPattern(1, 0, 0, LED_brightness, 500, 0);
  blinkRGBLedInPattern(1, LED_brightness, 0, 0, 500, 0);
}

// blink white, cyan, magenta, yellow, white short pulses
void indicateGatewayStart()
{
  blinkRGBLedInPattern(1, LED_brightness, LED_brightness, LED_brightness, 300, 10);
  blinkRGBLedInPattern(1, 0, LED_brightness, LED_brightness, 300, 10);
  blinkRGBLedInPattern(1, LED_brightness, 0, LED_brightness, 300, 10);
  blinkRGBLedInPattern(1, LED_brightness, LED_brightness, 0, 300, 10);
  blinkRGBLedInPattern(1, LED_brightness, LED_brightness, LED_brightness, 300, 500);
}

// blink white, green, white, green, white, green short pulses
void indicateReadyToReceiveData()
{
  blinkRGBLedInPattern(1, LED_brightness, LED_brightness, LED_brightness, 500, 10);
  blinkRGBLedInPattern(1, 0, LED_brightness, 0, 500, 10);
  blinkRGBLedInPattern(1, LED_brightness, LED_brightness, LED_brightness, 500, 10);
  blinkRGBLedInPattern(1, 0, LED_brightness, 0, 500, 10);
  blinkRGBLedInPattern(1, LED_brightness, LED_brightness, LED_brightness, 500, 10);
  blinkRGBLedInPattern(1, 0, LED_brightness, 0, 500, 500);
}

void handle_other_config()
{
  if (server.method() == HTTP_POST && server.uri() == "/configuration/v1/other-config")
  {
    Serial.println("\nReceiving other configuration data");

    JsonDocument doc;
    String requestBody = server.arg("plain");
    DeserializationError error = deserializeJson(doc, requestBody);

    if (error)
    {
      Serial.print("JSON parse error: ");
      Serial.println(error.c_str());
      server.send(400, "text/plain", "Invalid JSON");
      return;
    }

