nimsara1999/gas_sensor_ble_esp32/src/main.cpp
  EEPROM.begin(EEPROM_SIZE);

  server.on("/configuration/v1/wifi-config", HTTP_POST, handle_connect_to_new_wifi);
  server.on("/configuration/v1/other-config", HTTP_POST, handle_other_config);
  server.on("/check/v1/check-internet", HTTP_GET, handle_check_internet_connection);
  server.on("/check/v1/confirm-synced-sensor", HTTP_GET, handle_confirm_synced_sensor);
  server.on("/check/v1/sync-sensor", HTTP_GET, handle_sync_sensor);
  server.on("/made-by", []()
            { server.send(200, "text/plain", "Made by Nimsara & Sasindu."); });

  bluetooth_sending_status = false;
  client.setInsecure(); // For development purposes, skip certificate validation

  // Try to connect to saved Wi-Fi credentials and load other configuration data
  if (!tryConnectToSavedWiFi() || timeZone == "NA" || tankSize == "NA" || longitude == "NA" || latitude == "NA" || loadedHeight == "NA" || selected_sensor_mac_address == "NA")
  {
    if (!handleButtonPress())
    {
      Serial.println("Automatically starting AP mode");
      blinkRGBLedInPattern(3, 0, 0, LED_brightness, 30, 50); // blink blue LED short pulses for 3 times
      WiFi.mode(WIFI_AP_STA);
      WiFi.softAP(ap_ssid, ap_password);
      Serial.println("Access Point Started");
      Serial.print("AP IP Address: ");
      Serial.println(WiFi.softAPIP());
      automatically_put_to_AP_mode = true;
      inAPMode = true;
    }
  }
  else
  {
    inAPMode = false;
    WiFi.mode(WIFI_STA);
    indicateSuccessfulConnection();
    if (isValidString(timeZone, 50) && isValidString(tankSize, 50) && isValidString(longitude, 50) && isValidString(latitude, 50) && isValidString(loadedHeight, 50))
    {
      bluetooth_sending_status = true;
      Serial.println("Data loaded from EEPROM.");
      Serial.print("Firmware Version: ");
      Serial.println(current_fw_version);
      check_for_fw_updates(0);
      indicateReadyToReceiveData();
      Serial.println("\nScanning for Gas sensor of MAC address: " + selected_sensor_mac_address);
    }
    else
    {
      Serial.println("Invalid data loaded from EEPROM. Restarting the gateway");
      while (1)
      {
        delay(100);
        blinkRGBLedInPattern(1, LED_brightness, 0, 0, 100, 200); // blink red LED short pulses
        if (handleButtonPress())
        {
          break;
        }
      }
    }
  }

  server.begin();

  timeClient.begin();

  BLEDevice::init("");
  pBLEScan = BLEDevice::getScan();
  pBLEScan->setAdvertisedDeviceCallbacks(new AdvertisedDeviceCallbacks());
  pBLEScan->setActiveScan(false);
  pBLEScan->setInterval(100);
  pBLEScan->setWindow(99);
}

void loop()
{
  server.handleClient();

  if (inAPMode)
  {
    blinkLEDInAPMode();
  }
  else
  {
    check_for_fw_updates(fw_update_interval);
    handleButtonPress();
    BLEScanResults foundDevices = pBLEScan->start(scanTimeSeconds, false);
    pBLEScan->clearResults();
  }
}